import 'package:afkar/shared/constant.dart';
import 'package:clipboard/clipboard.dart';
import 'package:easy_localization/easy_localization.dart';
import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:fluttertoast/fluttertoast.dart';
import 'package:url_launcher/url_launcher.dart';

class HomeScreen extends StatelessWidget {
  const HomeScreen({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return  Scaffold(
      backgroundColor: color5,
      body: ListView.builder(
        physics: const BouncingScrollPhysics(),
          itemCount: thoughts.length,
          itemBuilder: (context, index) {
            return Container(
              alignment: Alignment.center,
              padding: const EdgeInsets.symmetric(vertical: 15,horizontal: 15),
              margin: const EdgeInsets.all(10),
              decoration: BoxDecoration(
                  color: color7,
                borderRadius: BorderRadius.circular(16)
              ),
              child: Column(
                children: [
                  Text(
                      thoughts[index],
                    textAlign: TextAlign.center,
                    style: const TextStyle(
                      fontWeight: FontWeight.w700,
                      fontSize: 19,
                      color: Colors.white
                    ),
                  ),
                  const SizedBox(height: 10,),
                  IconButton(
                      onPressed: () {
                        FlutterClipboard.copy(thoughts[index]).then((value){
                          Fluttertoast.showToast(
                              msg: "CopiedToClipboard".tr(),
                              timeInSecForIosWeb: 12,
                              gravity: ToastGravity.BOTTOM
                          );
                        });
                     // showBottomSheet(
                     //     context: context,
                     //     builder: (context) {
                     //       return Container(
                     //         width: double.infinity,
                     //         height: 200,
                     //         decoration: BoxDecoration(
                     //             color: Colors.white,
                     //           borderRadius: BorderRadius.circular(15),
                     //         ),
                     //         child: Column(
                     //           children: [
                     //             SizedBox(height: 10.h,),
                     //             Text(
                     //               "Open With",
                     //               style: TextStyle(
                     //                 fontSize: 19.sp,
                     //                 fontWeight: FontWeight.bold
                     //               ),
                     //             ),
                     //             Row(
                     //               children: [
                     //                 IconButton(
                     //                     onPressed: () {
                     //                       FlutterClipboard.copy(thoughts[index]).then((value){
                     //                         Fluttertoast.showToast(
                     //                             msg: "Copied To Clipboard",
                     //                             timeInSecForIosWeb: 12,
                     //                             gravity: ToastGravity.BOTTOM
                     //                         );
                     //                       });
                     //                     },
                     //                     icon: Icon(
                     //                       Icons.copy_outlined,
                     //                       color: Colors.black,
                     //                       size: 35.sp,
                     //                     ),
                     //                 )
                     //               ],
                     //             )
                     //           ],
                     //         ),
                     //       );
                     //     },
                     // );

                        // launchUrl(
                        //     Uri.parse("https://t.me/stech_flutter"),
                        //   mode: LaunchMode.externalApplication
                        // ).then((value) {
                        //   print(value.toString());
                        // }).catchError((onError){
                        //   print(onError.toString());
                        // });
                      },
                      icon: const Icon(
                        Icons.copy_outlined,
                        size: 35,
                        color: Colors.white,
                      ),
                  )
                ],
              ),
            );
          },
      ),
    );
  }
}
//https://t.me/r3lix/165506

List<String> thoughts  = [
  """واليوم لم أعد أدري ، هل ما آلت إليه الأمور الآن والشيء الذي يحدث في داخلي ، يأس أو استسلام ، أو نضج غير متوقع ، أو عدم مبالاة تجعلني أتقبل كل شيء دون انفعال ، أو قد يكون انطفاء بعد عدة حرائق متتالية ، لكن هذا الهدوء يثير قلقي لدرجة أني قد أعتاد عليه إلى الأبد .""",
  """يحُسن مواساة كلّ الناس إلا نفسه .""",
  """‏من السيء أنك من بعد تجاوزك لأغلب الأشياء، مازال بداخلك لحظة من الماضي مخلّدة تُشعرك إن كل ذلك التجاوز لم يكن شيئًا.""",
  """من سيصدق أن حروباً تدور بداخلك منذ زمن وأن بصدرك مدناً إنهارت بأكملها وأنت مازلت لا تُظهر شيئاً.""",
  """‏فقط لو أني أستطيع أن أُغمض قلبي قليلًا، ليهدأ من جميع الفوضى التي تراكمت به .""",
  """- أنا لا أكره أحدًا ، حتى صديقي الذي خذلني لازلت أحبه ، لكني لا أستطيع تقبله بجواري مرة أخرى.""",
  """مُرهق ، متعب ، حزين ، مجروح ، مكسور مكتئب ، قلق ، خائف ، أعتقد أنها مجرد كلمات مبتذله لآ يمكنها وصف ما تشعرون به .""",
  """لقد كُنا درساً لبعضنا البعض ، أنت علمتني أن لا أمنح الثقة إلى أحد ، و أنا علمتك أن الشعور الجميل إذا غادر فإنه لن يعود أبداً .""",
  """يوجد إقتباس مُخيف يقول: "أنا لا أهجر أحدًا، إنما أتغيّر بشكل يجعلك تبحث عني وأنا جالس أمامك".""",
  """‏لا أنام جيدا ليلاً ، ولا أرتاح بما يكفيني نهاراً ، ولا أهتم بصحتي ، وأكتم كل شيء بقلبي وأبتسم ، كم أنا سيء بحق نفسي .""",
  """قيل في الخذلان : 
ما كنتُ أحسبُهُ يرجو لي ألماً لكنه رماني بسهمٍ هد أركاني.""",
  """أكبر حريق داخل الانسان ينشب مع شراره ما تركه ناقصاً فهمت هذا وأن كنت متاخراً لو أستطيع الرجوع إلى الماضي كي لا أدع تلك النار تدخل قلبي ولكن لن يعود الماضي كالاغاني القديمه""",
  """- أريد أن أختفي ، بهذهِ البساطه ومن دونَ أن أترك تفاصيل دفن ومشاعِر فراق ورائي ، أختفيّ وكأنني لم أوجد يوماً .ِ""",
  """لن اشرح شيئا بعد الان لقد اكتفيت بمشاهده الاشياء وهي تذهب وهي تأتي ادركت عدم اهتميتي حين لم يلاحظ احد الانطفاء بداخلي .""",
  """‏وعرفت أن الأشياء دومًا مهددة بالغياب ، و أنني ذات يوم كنت هنا في هذا المكان حيث لن أكون أبدًا مرة أخرى 🖤 .""",
  """لا تحاول أن تغير من أحدهم حتى يلائمك، ولا تغير من نفسك لتلائم غيرك، خُلقنا مختلفين لنتكامل وليس لنتناسخ، فالأختلاف جمال آخر لا تدركه عقولنا .""",
  """- أوهمت نفسي كثيراً أني أريد الحزن ولا أريد السعادة، إلى أن ادركت مؤخراً أن لا أحد يستحق حزني وحزن نبرتي وحزن عيني""",
  """- أشعر كأني غريب عن هذا العالم حياتي كلها تشعرني أني لا أنتمي إلى أي شيء، لقد كنت دائماً من شتى الطرق مثل صدع وحاجتي الدائمة هي الصمت.""",
  """- أحب غربتي في زحام البشر، أحتمي بصمتي، أتسلى بالتأمل، أحيا داخل أفكاري، روحي تختار من يتسع لهم قلبي.""",
  """- أدركت مؤخراً أني قد أرهقت نفسي كثيراً بمنح قلبي ذات يوم لمن لم يستوعبني، ويؤمن بي، ويؤمن بأحلامي، معتقداتي، قدراتي والكثير من أفكاري.""",
  """- لأول مره لا أعلم ماذا أكتب، حائراً لقد نفذت كلماتي، كأن كل شيء انتهى، مرحله من فقدان الشغف عمت أرجائي ، لا أعلم أحقاً مللت أم فاض الحزن في قلبي.""",
  """- ‏مُرهق كمن ركض في طريق طويل هارباً من كُل شيء ، حتى وصل مُنهكاً إلى مكان يُشبه تماماً ما كان يهرب منه.""",
  """- أتفهم كل الذين يراقبون بصمت أشياءهم العزيزة وهي تسير خارج حياتهم، دون أدنى محاوله لإيقافها ، والرغبة لمعرفة الأسباب.""",
  """- من المؤسف أن تشعر بأن الجميع تخلي عنك، لأن أحدهم لم يعد بجانبك، والسبب أنت لافراطك في جعله كالجميع وتركت الجميع من حولك.""",
  """‏- إنني أحاول دائمًا بأن أحافظ على خفتي، خفتي في البقاء و الرحيل، لطالما كانت أكبر مخاوفي أن أكون  ثقيلاً.""",
  """محتاج افوق واضحك واكون اقوي
محتاج اقف علي رجلي من تاني
وتعبت امثل اني بستقوي!
مليت اقضي سنيني وحداني 
محتاج أصدق عقلي لما يقول
علي حد حابه انه مش ولابد
محتاج اسكت قلبي لما يدق
محتاج مبصش علي اللي راح مني
محتاج لواحد بس ييجي يزق!
مبقيتش قادر امشي خطوة كمان
مبقيتش عارف :
 هيحصل ايه قدام.!""",
  """- غالباً نمارس الصمت ليس لكوننا ضعفاء ، إنما لتعني أن هنا في أعماقنا حروفاً لو نطقنا بها، لاهتزت أبدانهم وجعاً وأسىً وندماً.""",
  """ربما ‏ما كان ينبغي علي أن آخُذ الوعود جميعها على محمل الجد ، لكنني ظننت الجميع مثلي، حين أعدهم بشيء حتمًا سأفعله """,
  """- من المؤسف أن تشعر بأن الجميع تخلي عنك، لأن أحدهم لم يعد بجانبك، والسبب أنت لافراطك في جعله كالجميع وتركت الجميع من حولك.""",
  """‏كيف تود نهايتك؟  ربما المشهد في عقلك أكثر سهولة حتى يصبح الأمر واقع، وتصل إلى نقطة النهاية ويتوقف كل شيء وتسقط على ركبتيك باكياً.""",
  """مع مرور الوقت لن ترى الشروق أو الغروب كما كنت تراه في السابق تتلاشى الرغبات ويصل الإنسان لمرحلة الإعتياد، تستيقظ لانك مضطر، "وكيف حالك؟"طبعاً بخير حتى وإن كان العكس تماماً.""",
  """بينَ ثانِيه وثانِيه، يمُوت يأس، ويحيَا أملّ، تبتسِمُ شِفاه، وتدمَع أعُين، يخُون صدِيق، ويُخلِص عدُو، بيَن الثّانِيه والثّانِيه، تُوجَد حيَاة.""",
  """‏فعلت ما بوسعي كي أدفع هذا الالم بعيداً لكنني أستيقظ كل يوم وأجده لا يزال موجوداً، ماذا بوسعي أن أفعل أكثر.. لم يفلح شيء في إذابة هذا التعب المزمن، سأعتزل الكتابه عقلي فرغ، داخلي لا يستطيع التعبير من شده الالم..""",
  """هذهِ التّجاعيد ليست شيئاً، هذا الشّعر الرّماديّ ليس شيئاً، هذهِ المعدةُ المُترهِّلة بأطعمةٍ قديمةٍ، هذان الكاحلان المُنتفخان ورضوضُهما، دماغي الغارق في الظُّلمة، ليستْ شيئاً، أنا الفتى نفسُه الّذي اعتادتْ أمّي أن تُقبِّله.""",
  """‏هل جربت شعور أن تكون مُتعب بلا أسباب فقط مُتعب ولا تستطيع شرح تلك الكلمة سوى بالصمت الطويل والتحديق في اللا شيء، ولا كلام يقال ليريحك فقط كل ما توُّده أن تمر غيمة الحزن تلك من على صدرك بسلام، لا شيء غير ذلك.""",
  """- لم أشعر بالانتماء إلى الأماكن التي أحببتها يوماً، لطالما كنت أشعر بالغربة في وسط عائلتي لم أشعر بأحد يفهمني ويدرك حقيقة ما أمر به""",
  """- الحرية تكمن في أن نمثل أنفسنا، فهي الحقيقة والاحق ، لا شيء يمكن أن يقف في طريقك وأنت في سبيل البحث عن نفسك""",
  """- هل كان التمسك بنا صعباً إلى تلك الدرجة، حتى أصبح إفلاتنا بتلك السهولة، لا بأس لك الأمان يا قلبي ولن أجازف بك مرة أخرى""",
  """- أحب غربتي في زحام البشر، أحتمي بصمتي، أتسلى بالتأمل، أحيا داخل أفكاري، روحي تختار من يتسع لهم قلبي.""",
  """- أدركت مؤخراً أني قد أرهقت نفسي كثيراً بمنح قلبي ذات يوم لمن لم يستوعبني، ويؤمن بي، ويؤمن بأحلامي، معتقداتي، قدراتي والكثير من أفكاري.""",
  """‏- إنني أحاول دائمًا بأن أحافظ على خفتي، خفتي في البقاء و الرحيل، لطالما كانت أكبر مخاوفي أن أكون  ثقيلاً.""",
  """- ‏كُتب علينا العيش هكذا مُعلقين في منتصف الأشياء كلها، لا نحب ما يحدث، ولا يحدث ما نحبه أبدًا، العيش في مكان كهذا مؤلم جدًا.""",
  """- نحن ضحايا الأشياء التي لا نقولها فكلما زادت درجة كتمانك، زاد تعبك، علاقة طردية، وأنت الضحية الوحيد لذلك""",
  """- أُعيد قراءة رسائلك القديمة، بمقدار عشرات المرات في كل يوم، وفي كل مرة أصل بها إلى الخاتمة ، أشعر وكأن الغم قد أذابني و عانق الأكتئاب قلبي.""",
  """- الكلمات الجارحة تتحول إلى جدران عازلة، وليس بإمكان أي شيء أن يذيب هذه الجدران ، أو يهدمها، لا أعتذار، ولا أبتسامات، ولا كلامٌ طيّب""",
  """- اصعب الألم هي مقاومة انفسنا عندما نشعر بالرغبه في الإنفجار ولكننا نفضل ان ننفجر بأعماق أعماقنا حتى لا يشعر بنا احد.""",
  """- لا أعلم حقيقة ما أمر به هذه الأيام، هنا فقط أشياء غامضة تأتي من العدم فتبعث في قلبي شعوراً غامضاً قاتلاً حتى يكاد يكون مميتاً، لا أعلم كيفية الخلاص.""",
  """عناق الأرواح لا يخضع لقانون المسافات فما اكثر الكلمات التي اِحتضنت أرواحنا وآلاف الأميال تفصل بين قائليها.""",
  """- كان علي أن أدرك أنه سيأتي ذلك اليوم الذي سيتم كسري فيه بلا رحمة، كان علي وضع تلك الفكرة ، وأننا سنكسر يوماً ما بأي شيء من أقرب الأشخاص لقلوبنا.""",
  """- بعض الكسور مؤلمة وقاتلة جداً لدرجة أنه لايمكن حتى التعبير عنها بكلمات، أو وصفها بشعور، أو تخيلها حتى بتفكير او بخيبة.""",
  """- ستظل معتقداً أنك بخير، حتي تجد نفسك مستيقظاً في الثانية فجراً، تفكر في كل شئ وفي اللاشئ في الوقت نفسه""",
  """- نحن لا نموت حين تفارقنا الروح وحسب، نموت قبل ذلك حين تتشابه أيامنا، ونتوقف عن التغيير، حين لا يزداد شيء سوى أعمارنا وأوزاننا.""",
  """- ‏تؤسفني السهولة لا الأسباب ، يهمني الحدث لا طرب الحديث ، مرونة أن يتحول شخص عزيز إلى شخص عادي ، وأقل من ذلك.""",
  """ اعلم انني قد اعبر في مخيلتك كلما رأيت مكانًا كان يجمعنا، متأكدة بأنك تشتاق حتى لو لم تقر وتعترف بذلك، انت لا تستطيع نسياني، انا لا اُنسى.""",
  """- ‏تؤسفني السهولة لا الأسباب ، يهمني الحدث لا طرب الحديث ، مرونة أن يتحول شخص عزيز إلى شخص عادي ، وأقل من ذلك""",
];